{
  "Home": "Beranda",
  "About": "Tentang",
  "Portofolio": "Portofolio",
  "Project": "Proyek",
  "Gallery": "Galeri",
  "Blog": "Tulisan",
  "Contact": "Kontak",
  "Download CV": "Download CV",

  "seo.home.title": "Ilham Kurniawan - Fullstack Developer & Jiwa Kreatif",
  "seo.home.description": "Selamat datang di ruang digital saya! Saya developer fullstack muda yang suka banget bikin website keren. Lagi nge-vibe dengan Vue, Nuxt, dan semua hal tentang teknologi.",
  "seo.about.title": "Tentang Saya - Kenalan Lebih Dekat dengan Developer di Balik Kode",
  "seo.about.description": "Yuk, intip perjalanan saya sebagai developer, dari petualangan coding sampai eksperimen kreatif. Mari connect dan bikin sesuatu yang keren bareng!",
  "seo.gallery.title": "Galeri - Cerita Visual & Momen yang Tertangkap",
  "seo.gallery.description": "Koleksi pilihan kehidupan saya melalui lensa - dari meetup tech sampai pelarian kreatif. Setiap foto punya vibe-nya sendiri!",
  "seo.portfolio.title": "Portofolio - Proyek yang Menentukan Perjalanan Saya",
  "seo.portfolio.description": "Jelajahi portofolio web app, proyek mobile, dan solusi digital saya. Proyek nyata, dampak nyata, passion nyata.",
  "seo.cv.title": "Curriculum Vitae - Perjalanan Profesional Saya",
  "seo.cv.description": "Download CV saya untuk mengetahui lebih lanjut tentang keahlian, pengalaman, dan pencapaian saya sebagai fullstack developer.",

  "Hello my name is Ilham Kurniawan": "Halo, saya Ilham Kurniawan",
  "Eager to learn": "Selalu ingin belajar",
  "new things": "hal baru",
  "and open to": "dan terbuka untuk",
  "opportunities": "peluang",
  "opportunities.": "peluang.",
  "Junior Fullstack Developer | AI Enthusiast | Undergraduate Student | Web3 Enthusiast": "Junior Fullstack Developer | AI Enthusiast | Mahasiswa | Web3 Enthusiast",
  "See More": "Lihat Lebih",
  "2026 | Copyright © KAIRAV": "2026 | Hak Cipta © KAIRAV",

  "Welcome to my gallery": "Selamat datang di galeri saya",
  "Explore My Journey": "Jelajahi Perjalanan Saya",
  "Through": "Melalui",
  "Lens": "Lensa",
  "Welcome to my photo gallery! Here, you'll find a collection of moments captured through my lens, showcasing my adventures, projects, and everyday life.": "Selamat datang di galeri foto saya! Di sini, kamu akan menemukan koleksi momen yang tertangkap melalui lensa saya, menampilkan petualangan, proyek, dan kehidupan sehari-hari.",
  "View Gallery": "Lihat Galeri",
  "Visit Instagram": "Kunjungi Instagram",
  "Photo": "Foto",
  "Collection": "Koleksi",
  "Each photo tells a unique story and reflects my passion for photography and creative expression.": "Setiap foto menceritakan kisah unik dan mencerminkan passion saya terhadap fotografi dan ekspresi kreatif.",
  "For more photos and updates, visit my Instagram": "Untuk lebih banyak foto dan update, kunjungi Instagram saya",

  "Backend Development": "Pengembangan Backend",
  "Integrating data and APIs to build robust and scalable backend systems.": "Mengintegrasikan data dan API untuk membangun sistem backend yang tangguh dan scalable.",
  "Frontend Development": "Pengembangan Frontend",
  "Building dynamic and interactive web applications with modern frameworks.": "Membangun aplikasi web yang dinamis dan interaktif dengan framework modern.",
  "Web & Mobile App": "Web & Aplikasi Mobile",
  "Transforming ideas into exceptional web and mobile app experiences.": "Mengubah ide menjadi pengalaman web dan aplikasi mobile yang luar biasa.",
  "UI/UX Design": "Desain UI/UX",
  "Crafting visually stunning user interfaces that captivate and engage users.": "Merancang antarmuka pengguna yang memukau secara visual dan engaging.",
  "What I": "Apa yang Saya",
  "Do": "Lakukan",
  "Specialized expertise across the full development spectrum": "Keahlian spesialis di seluruh spektrum pengembangan",

  "Skills &": "Keahlian &",
  "Modern tech stack for building scalable and performant applications": "Tech stack modern untuk membangun aplikasi yang scalable dan performant",

  "Education &": "Pendidikan &",
  "Training": "Pelatihan",
  "Formal and Non Formal": "Formal dan Non Formal",
  "Formal": "Formal",
  "Non-Formal": "Non-Formal",
  "Nahdlatul Ulama University Yogyakarta (UNUYO)": "Universitas Nahdlatul Ulama Yogyakarta (UNUYO)",
  "2023 - Present | Undergraduated": "2023 - Sekarang | Mahasiswa",
  "Currently pursuing a Bachelor's degree in Informatics, focusing on programming concepts, data structures, algorithms, and software development. Engaged in various projects and research activities.": "Sedang menempuh gelar Sarjana Informatika, fokus pada konsep pemrograman, struktur data, algoritma, dan pengembangan software. Terlibat dalam berbagai proyek dan kegiatan riset.",
  "Rumah Gemilang Indonesia Surabaya (RGI Surabaya)": "Rumah Gemilang Indonesia Surabaya (RGI Surabaya)",
  "2020 - 2021 | Graduated": "2020 - 2021 | Lulus",
  "Completed a Software Engineering training program specializing in Web Programming, covering HTML, CSS, JavaScript, and general web development. Participated in hands-on projects to build web applications.": "Menyelesaikan program pelatihan Software Engineering yang mengkhususkan diri dalam Web Programming, mencakup HTML, CSS, JavaScript, dan pengembangan web umum. Berpartisipasi dalam proyek hands-on untuk membangun aplikasi web.",
  "Graphic Design Training - DINPERINAKER Blora": "Pelatihan Desain Grafis - DINPERINAKER Blora",
  "2022 | Graduated": "2022 | Lulus",
  "Participated in a graphic design training program using CorelDRAW, learning design techniques, image manipulation, and the creation of visual materials. Completed various design projects and developed a strong portfolio.": "Berpartisipasi dalam program pelatihan desain grafis menggunakan CorelDRAW, mempelajari teknik desain, manipulasi gambar, dan pembuatan materi visual. Menyelesaikan berbagai proyek desain dan mengembangkan portofolio yang kuat.",

  "Work &": "Kerja &",
  "Experience": "Pengalaman",
  "Professional Journey": "Perjalanan Profesional",
  "Open for Work": "Buka untuk Kerja",
  "Fullstack Developer": "Fullstack Developer",
  "2021 - Present": "2021 - Sekarang",
  "Experienced full-stack developer with a strong foundation in programming concepts, data structures, and algorithms. Currently working as a freelance developer, successfully delivering various projects for clients. Open to both full-time positions and project-based collaborations.": "Developer full-stack berpengalaman dengan fondasi yang kuat dalam konsep pemrograman, struktur data, dan algoritma. Saat ini bekerja sebagai freelance developer, berhasil menyelesaikan berbagai proyek untuk klien. Terbuka untuk posisi full-time dan kolaborasi berbasis proyek.",
  "Internship": "Magang",
  "Junior Developer at Sekeco": "Junior Developer di Sekeco",
  "January 2025 - Present": "Januari 2025 - Sekarang",
  "Assisted in developing Gained hands-on experience with Nuxt.js and its ecosystem, Composition API, and server-side rendering (SSR). Worked with Nuxt modules and plugins to enhance application functionality. Collaborated with the development team to implement responsive designs and ensure cross-browser compatibility.": "Membantu dalam pengembangan aplikasi web. Mendapatkan pengalaman hands-on dengan Nuxt.js dan ekosistemnya, Composition API, dan server-side rendering (SSR). Bekerja dengan modul dan plugin Nuxt untuk meningkatkan fungsionalitas aplikasi. Berkolaborasi dengan tim development untuk mengimplementasikan desain responsif dan memastikan kompatibilitas lintas browser.",
  "Freelance": "Freelance",
  "Fullstack Web & Android Developer at Jurutani": "Fullstack Web & Android Developer di Jurutani",
  "2025 - Present": "2025 - Sekarang",
  "Developed and maintained web and Android applications for clients using modern technologies. Built responsive and user-friendly interfaces with Vue.js and Nuxt.js for web applications. Created Android applications using Kotlin, ensuring optimal performance and user experience. Collaborated with clients to gather requirements and deliver tailored solutions.": "Mengembangkan dan memaintain aplikasi web dan Android untuk klien menggunakan teknologi modern. Membangun interface yang responsif dan user-friendly dengan Vue.js dan Nuxt.js untuk aplikasi web. Membuat aplikasi Android menggunakan Kotlin, memastikan performa optimal dan user experience. Berkolaborasi dengan klien untuk mengumpulkan requirement dan memberikan solusi yang disesuaikan.",

  "There are no limits to what you can accomplish except the limits you place on your own thinking.": "Tidak ada batasan untuk apa yang bisa kamu capai kecuali batasan yang kamu tempatkan pada pikiranmu sendiri.",
  "Brian Tracy": "Brian Tracy",
  "The only way to do great work is to love what you do.": "Satu-satunya cara untuk melakukan pekerjaan hebat adalah mencintai apa yang kamu lakukan.",
  "Steve Jobs": "Steve Jobs",
  "Believe you can and you're halfway there.": "Percaya kamu bisa dan kamu sudah setengah jalan sampai di sana.",
  "Theodore Roosevelt": "Theodore Roosevelt",
  "Don't watch the clock; do what it does. Keep going.": "Jangan lihat jam; lakukan apa yang jam lakukan. Terus berjalan.",
  "Sam Levenson": "Sam Levenson",
  "Success is not final, failure is not fatal: it is the courage to continue that counts.": "Kesuksesan bukan akhir, kegagalan bukan fatal: yang penting adalah keberanian untuk terus melanjutkan.",
  "Winston Churchill": "Winston Churchill",
  "It's never too late to become whatever you want to be.": "Tidak pernah terlambat untuk menjadi apapun yang kamu inginkan.",
  "George Eliot": "George Eliot",

  "Interested in collaborating?": "Tertarik untuk berkolaborasi?",
  "Get In Touch": "Hubungi Saya",
  "View works": "Lihat Karya",

  "Portfolio not found": "Portofolio tidak ditemukan",
  "View project details and portfolio": "Lihat detail proyek dan portofolio",

  "Featured": "Unggulan",
  "Recent": "Terbaru",
  "Portfolio": "Portofolio",
  "Portrait Photography": "Fotografi Potret",
  "Capturing emotions and personality in every frame": "Menangkap emosi dan kepribadian di setiap bingkai",
  "Urban Exploration": "Eksplorasi Urban",
  "Discovering beauty in city landscapes": "Menemukan keindahan dalam lanskap kota",
  "Nature Vibes": "Vibes Alam",
  "Finding peace in natural scenery": "Menemukan kedamaian dalam pemandangan alami",
  "Street Photography": "Fotografi Jalanan",
  "Life moments in everyday scenes": "Momen kehidupan dalam pemandangan sehari-hari",
  "Professional Shoots": "Pemotretan Profesional",
  "Commercial and editorial photography": "Fotografi komersial dan editorial",
  "Creative Experiments": "Eksperimen Kreatif",
  "Pushing boundaries with new techniques": "Mendorong batas dengan teknik baru",

  "Welcome to my projects": "Selamat datang di proyek saya",
  "Innovative": "Inovatif",
  "Projects": "Proyek",
  "Solutions": "Solusi",
  "Here are some of the projects I've worked on, showcasing my skills and passion for creating innovative solutions that make a real impact.": "Berikut adalah beberapa proyek yang telah saya kerjakan, menampilkan keahlian dan passion saya dalam menciptakan solusi inovatif yang memberikan dampak nyata.",
  "View Details": "Lihat Detail",
  "Back to Home": "Kembali ke Beranda",
  "Featured Work": "Karya Unggulan",
  "A collection of my projects, showcasing my skills in creating innovative and effective solutions across different domains.": "Koleksi proyek saya, menampilkan keahlian dalam menciptakan solusi inovatif dan efektif di berbagai domain.",
  "Search projects by name, description, or tags...": "Cari proyek berdasarkan nama, deskripsi, atau tag...",
  "Showing": "Menampilkan",
  "of": "dari",
  "projects": "proyek",
  "No Projects Found": "Tidak Ada Proyek Ditemukan",
  "Try adjusting your search or filter criteria": "Coba sesuaikan pencarian atau kriteria filter Anda",
  "Clear Filters": "Hapus Filter",
  "Delivering excellence across all aspects of software development": "Memberikan keunggulan di semua aspek pengembangan software",

  "Project Info": "Info Proyek",
  "Client": "Klien",
  "Status": "Status",
  "Industry": "Industri",
  "Date": "Tanggal",
  "Services": "Layanan",
  "Technologies": "Teknologi",
  "Back to Projects": "Kembali ke Proyek",
  "More Projects": "Proyek Lainnya",
  "Previous Project": "Proyek Sebelumnya",
  "Next Project": "Proyek Selanjutnya",

  "Year": "Tahun",
  "Role": "Peran",
  "Duration": "Durasi",
  "Live Preview": "Lihat Demo",

  "CURRICULUM": "CURRICULUM",
  "VITAE": "VITAE",
  "Ilham Kurniawan · Software Developer": "Ilham Kurniawan · Software Developer",
  "© 2026 KAIRAV Portfolio": "© 2026 KAIRAV Portfolio",

  "Page Not Found": "Halaman Tidak Ditemukan",
  "Sorry, the page you're looking for doesn't exist.": "Maaf, halaman yang Anda cari tidak ada.",
  "Server Error": "Error Server",
  "Something went wrong on our end. Please try again later.": "Ada yang salah di sisi kami. Silakan coba lagi nanti.",
  "Access Forbidden": "Akses Ditolak",
  "You don't have permission to access this resource.": "Anda tidak memiliki izin untuk mengakses resource ini.",
  "Error": "Error",
  "ERROR": "ERROR",
  "An unexpected error occurred.": "Terjadi error yang tidak terduga.",
  "Go to Home": "Ke Beranda",
  "Go Back": "Kembali",
  "If you think this is a mistake, please contact support": "Jika Anda pikir ini kesalahan, silakan hubungi support",
  "Continuously learning and expanding skillset with emerging technologies": "Terus belajar dan memperluas keahlian dengan teknologi baru",
  "Project Gallery": "Galeri Proyek"
}