{
  "Home": "Beranda",
  "About": "Tentang",
  "Project": "Proyek",
  "Gallery": "Galeri",
  "Blog": "Tulisan",
  "Contact": "Kontak",
  "Download CV": "Download CV",
  "Contact Me": "Hubungi Saya",
  "Hello my name is Ilham Kurniawan": "Halo nama saya Ilham Kurniawan",
  "Eager to learn": "Senang belajar",
  "new things": "hal baru",
  "and open to": "dan terbuka untuk",
  "opportunities": "peluang",
  "opportunities.": "peluang.",
  "Junior Fullstack Developer | AI Enthusiast | Undergraduated Student | Web3 Enthusiast": "Junior Fullstack Developer | Antusias AI | Mahasiswa | Antusias Web3",
  "See More": "Lihat Lebih Lanjut",
  "2026 | Copyright © KAIRAV": "2026 | Copyright © KAIRAV",
  "Welcome to my gallery": "Selamat datang di galeri saya",
  "Explore My Journey": "Jelajahi Perjalanan Saya",
  "Through": "Melalui",
  "Lens": "Lensa",
  "Welcome to my photo gallery! Here, you'll find a collection of moments captured through my lens, showcasing my adventures, projects, and everyday life.": "Selamat datang di galeri foto saya! Di sini, Anda akan menemukan koleksi momen yang diabadikan melalui lensa saya, menampilkan petualangan, proyek, dan kehidupan sehari-hari saya.",
  "View Gallery": "Lihat Galeri",
  "Visit Instagram": "Kunjungi Instagram",
  "Photo": "Foto",
  "Collection": "Koleksi",
  "Each photo tells a unique story and reflects my passion for photography and creative expression.": "Setiap foto menceritakan kisah unik dan mencerminkan passion saya dalam fotografi dan ekspresi kreatif.",
  "For more photos and updates, visit my Instagram": "Untuk lebih banyak foto dan update, kunjungi Instagram saya",
  "Get in touch": "Hubungi saya",
  "View works": "Lihat karya",
  "What I": "Apa yang Saya",
  "Do": "Lakukan",
  "Specialized expertise across the full development spectrum": "Keahlian khusus di seluruh spektrum pengembangan",
  "Backend Development": "Pengembangan Backend",
  "Integrating data and APIs to build robust and scalable backend systems.": "Mengintegrasikan data dan API untuk membangun sistem backend yang kuat dan scalable.",
  "Frontend Development": "Pengembangan Frontend",
  "Building dynamic and interactive web applications with modern frameworks.": "Membangun aplikasi web yang dinamis dan interaktif dengan framework modern.",
  "Web & Mobile App": "Aplikasi Web & Mobile",
  "Transforming ideas into exceptional web and mobile app experiences.": "Mengubah ide menjadi pengalaman aplikasi web dan mobile yang luar biasa.",
  "UI/UX Design": "Desain UI/UX",
  "Crafting visually stunning user interfaces that captivate and engage users.": "Menciptakan antarmuka pengguna yang memukau secara visual dan menarik perhatian pengguna.",
  "Delivering excellence across all aspects of software development": "Memberikan keunggulan di semua aspek pengembangan perangkat lunak",
  "Skills &": "Keahlian &",
  "Technologies": "Teknologi",
  "Modern tech stack for building scalable and performant applications": "Stack teknologi modern untuk membangun aplikasi yang scalable dan performant",
  "Education &": "Pendidikan &",
  "Training": "Pelatihan",
  "Formal and Non Formal": "Formal dan Non Formal",
  "Formal": "Formal",
  "Non-Formal": "Non-Formal",
  "Nahdlatul Ulama University Yogyakarta (UNUYO)": "Universitas Nahdlatul Ulama Yogyakarta (UNUYO)",
  "2023 - Present | Undergraduated": "2023 - Sekarang | Sedang Menempuh",
  "Currently pursuing a Bachelor's degree in Informatics, focusing on programming concepts, data structures, algorithms, and software development.": "Saat ini sedang menempuh gelar Sarjana Informatika, fokus pada konsep pemrograman, struktur data, algoritma, dan pengembangan perangkat lunak.",
  "Rumah Gemilang Indonesia Surabaya (RGI Surabaya)": "Rumah Gemilang Indonesia Surabaya (RGI Surabaya)",
  "2020 - 2021 | Graduated": "2020 - 2021 | Lulus",
  "Completed a Software Engineering training program specializing in Web Programming, covering HTML, CSS, JavaScript, and general web development.": "Menyelesaikan program pelatihan Rekayasa Perangkat Lunak dengan spesialisasi Pemrograman Web, mencakup HTML, CSS, JavaScript, dan pengembangan web umum.",
  "Graphic Design Training - DINPERINAKER Blora": "Pelatihan Desain Grafis - DINPERINAKER Blora",
  "2022 | Graduated": "2022 | Lulus",
  "Participated in a graphic design training program using CorelDRAW, learning design techniques, image manipulation, and the creation of visual materials.": "Berpartisipasi dalam program pelatihan desain grafis menggunakan CorelDRAW, mempelajari teknik desain, manipulasi gambar, dan pembuatan materi visual.",
  "Work &": "Pekerjaan &",
  "Experience": "Pengalaman",
  "Professional Journey": "Perjalanan Profesional",
  "Open for Work": "Terbuka untuk Bekerja",
  "Fullstack Developer": "Fullstack Developer",
  "2021 - Present": "2021 - Sekarang",
  "Experienced full-stack developer with a strong foundation in programming concepts, data structures, and algorithms. Currently working as a freelance developer, successfully delivering various projects for clients. Open to both full-time positions and project-based collaborations.": "Pengembang full-stack berpengalaman dengan fondasi kuat dalam konsep pemrograman, struktur data, dan algoritma. Saat ini bekerja sebagai pengembang freelance, berhasil menyelesaikan berbagai proyek untuk klien. Terbuka untuk posisi full-time dan kolaborasi berbasis proyek.",
  "Internship": "Magang",
  "Junior Developer at Sekeco": "Junior Developer di Sekeco",
  "January 2025 - Present": "Januari 2025 - Sekarang",
  "Assisted in developing Gained hands-on experience with Nuxt.js and its ecosystem, Composition API, and server-side rendering (SSR). Worked with Nuxt modules and plugins to enhance application functionality. Collaborated with the development team to implement responsive designs and ensure cross-browser compatibility.": "Membantu dalam pengembangan dengan mendapatkan pengalaman langsung dengan Nuxt.js dan ekosistemnya, Composition API, dan server-side rendering (SSR). Bekerja dengan modul dan plugin Nuxt untuk meningkatkan fungsionalitas aplikasi. Berkolaborasi dengan tim pengembangan untuk mengimplementasikan desain responsif dan memastikan kompatibilitas lintas browser.",
  "Freelance": "Freelance",
  "Fullstack Web & Android Developer at Jurutani": "Fullstack Web & Android Developer di Jurutani",
  "2025 - Present": "2025 - Sekarang",
  "Developed and maintained web and Android applications for clients using modern technologies. Built responsive and user-friendly interfaces with Vue.js and Nuxt.js for web applications. Created Android applications using Kotlin, ensuring optimal performance and user experience. Collaborated with clients to gather requirements and deliver tailored solutions.": "Mengembangkan dan memelihara aplikasi web dan Android untuk klien menggunakan teknologi modern. Membangun antarmuka responsif dan user-friendly dengan Vue.js dan Nuxt.js untuk aplikasi web. Membuat aplikasi Android menggunakan Kotlin, memastikan performa optimal dan pengalaman pengguna. Berkolaborasi dengan klien untuk mengumpulkan kebutuhan dan memberikan solusi yang disesuaikan.",
  "There are no limits to what you can accomplish except the limits you place on your own thinking.": "Tidak ada batasan untuk apa yang bisa Anda capai kecuali batasan yang Anda tempatkan pada pemikiran Anda sendiri.",
  "Brian Tracy": "Brian Tracy",
  "The only way to do great work is to love what you do.": "Satu-satunya cara untuk melakukan pekerjaan hebat adalah mencintai apa yang Anda lakukan.",
  "Steve Jobs": "Steve Jobs",
  "Believe you can and you're halfway there.": "Percaya Anda bisa dan Anda sudah setengah jalan.",
  "Theodore Roosevelt": "Theodore Roosevelt",
  "Don't watch the clock; do what it does. Keep going.": "Jangan lihat jam; lakukan apa yang dilakukannya. Terus bergerak.",
  "Sam Levenson": "Sam Levenson",
  "Success is not final, failure is not fatal: it is the courage to continue that counts.": "Kesuksesan bukanlah akhir, kegagalan bukanlah fatal: yang penting adalah keberanian untuk terus melanjutkan.",
  "Winston Churchill": "Winston Churchill",
  "It's never too late to become whatever you want to be.": "Tidak pernah terlambat untuk menjadi apa pun yang Anda inginkan.",
  "George Eliot": "George Eliot",
  "Interested in collaborating?": "Tertarik untuk berkolaborasi?",
  "Get In Touch": "Hubungi Saya",
  "Welcome to my blog": "Selamat datang di blog saya",
  "Coding,": "Coding,",
  "Coffee": "Kopi",
  "&": "&",
  "Creativity": "Kreativitas",
  "Through this blog, I want to invite you to take a closer look at my creative process, the projects I'm working on, and the things that excite me.": "Melalui blog ini, saya ingin mengajak Anda untuk melihat lebih dekat proses kreatif saya, proyek yang sedang saya kerjakan, dan hal-hal yang membuat saya bersemangat.",
  "Explore Articles": "Jelajahi Artikel",
  "Back to Home": "Kembali ke Beranda",
  "Articles &": "Artikel &",
  "Insights": "Wawasan",
  "Dive into a selection of insightful articles and reflections I've penned, sharing my expertise and perspectives on various topics.": "Selami pilihan artikel dan refleksi mendalam yang telah saya tulis, membagikan keahlian dan perspektif saya tentang berbagai topik.",
  "Read Article": "Baca Artikel",
  "Welcome to my projects": "Selamat datang di proyek saya",
  "Building": "Membangun",
  "Tomorrow's": "Solusi",
  "Solutions": "Masa Depan",
  "Today": "Hari Ini",
  "Explore a curated showcase of my work—each project represents innovation, dedication, and a commitment to creating impactful digital solutions.": "Jelajahi showcase kurasi karya saya—setiap proyek merepresentasikan inovasi, dedikasi, dan komitmen untuk menciptakan solusi digital yang berdampak.",
  "Featured": "Unggulan",
  "Projects": "Proyek",
  "A collection of my best work, highlighting innovation and craftsmanship in every detail.": "Koleksi karya terbaik saya, menyoroti inovasi dan keahlian di setiap detail.",
  "View Details": "Lihat Detail",
  "Live Preview": "Lihat Preview",
  "blog.notFound": "Artikel blog tidak ditemukan",
  "blog.tableOfContents": "Daftar Isi",
  "blog.toc.description": "Navigasi melalui bagian-bagian",
  "blog.share": "Bagikan Artikel",
  "blog.previous": "Artikel Sebelumnya",
  "blog.next": "Artikel Berikutnya",
  "project.notFound": "Proyek tidak ditemukan",
  "project.previous": "Proyek Sebelumnya",
  "project.next": "Proyek Berikutnya"
}